#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=78034a915ae7e28245eef0578a8e8008174bc44c2af78c9ba4a469a398498927]
random_id.id_flow: Refreshing state... [id=ufv5w2ozwO8]
module.ubunturoutervm.random_id.randomid_pip[0]: Refreshing state... [id=N4jWfw]
module.ubunturoutervm.random_id.randomIdVM: Refreshing state... [id=qQ9YUoT6nBQ]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=1084986733]
data.azuread_client_config.this: Reading...
data.azuread_client_config.this: Read complete after 0s [id=400ebb99-99e3-4a2a-af83-b2b5edff74fa-18a2dc63-b93f-42f1-b9d6-f4fe7d8c2b4e-2035781a-45a2-4065-ab81-e1b924cd8eae]
module.spoke1network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001]
module.spoke2network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001]
data.azurerm_key_vault.secrets: Reading...
azurerm_resource_group.rg_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001]
azurerm_resource_group.rg_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001]
module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/publicIPAddresses/pip-vm-hub-dev-001]
module.spoke2network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001]
module.spoke2network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001]
module.spoke1network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001]
module.spoke1network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001]
module.spoke2network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
azurerm_network_watcher.networkwatcher_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub]
azurerm_network_security_group.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
azurerm_storage_account.flow: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Storage/storageAccounts/stflowb9fbf9c36a33c0ef]
azurerm_virtual_network.hub_vnet: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001]
data.azurerm_key_vault.secrets: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-tf-infra-001/providers/Microsoft.KeyVault/vaults/kv-tf-infra-sec-001]
azurerm_log_analytics_workspace.law_platform: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.OperationalInsights/workspaces/law-platform]
data.azurerm_key_vault_secret.vmpassword: Reading...
module.spoke1network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_network_security_group.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-LogicTier]
module.spoke2network.azurerm_network_security_group.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-DatabaseTier]
module.spoke2network.azurerm_network_security_group.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-WebTier]
azurerm_subnet.hub_subnet["RouterSubnet"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Reading...
module.spoke2network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/virtualNetworkPeerings/vnet-spoke2-001-hub]
module.spoke2network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke2-001]
module.spoke1network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/virtualNetworkPeerings/vnet-spoke1-001-hub]
module.spoke1network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke1-001]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
data.azurerm_key_vault_secret.vmpassword: Read complete after 2s [id=https://kv-tf-infra-sec-001.vault.azure.net/secrets/vmpassword/cd3cca8343d14d4890d1645375fe30fc]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_network_security_group.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-DatabaseTier]
module.spoke1network.azurerm_network_security_group.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-LogicTier]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
module.spoke1network.azurerm_network_security_group.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-WebTier]
azurerm_subnet_network_security_group_association.nsg_router-association: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.ubunturoutervm.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-hub-dev-001-a90f585284fa9c14]
azurerm_monitor_diagnostic_setting.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router|nsg_router_diag]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001/routes/default-route-entry]
module.spoke2network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001/routes/default-route-entry]
module.ubunturoutervm.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001]
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke1.random_id.randomIdVM: Refreshing state... [id=RHBx4BeBJoU]
azurerm_virtual_machine_extension.ubunturoutervm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001/extensions/vm-hub-dev-001-networkwatcher]
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke2.random_id.randomIdVM: Refreshing state... [id=6Z5NKFxmZaQ]
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke1.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-447071e017812685]
module.ubuntuspoke2.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-e99e4d285c6665a4]
module.ubuntuspoke1.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001]
module.ubuntuspoke2.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001]
azurerm_network_watcher_flow_log.hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/hub-flow]
azurerm_network_watcher_flow_log.spoke2: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke2flow]
azurerm_network_watcher_flow_log.spoke1: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke1-flow]
azurerm_network_connection_monitor.ubunturoutervm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-hub-dev-001-ubuntucom]
azurerm_virtual_machine_extension.spoke1vm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001/extensions/vm-spoke1-dev-001-networkwatcher]
azurerm_virtual_machine_extension.spoke2vm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001/extensions/vm-spoke2-dev-001-networkwatcher]
azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke1-dev-001-ubuntucom]
azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke2-dev-001-ubuntucom]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_disk_encryption_set.encryption_compute will be created
  + resource "azurerm_disk_encryption_set" "encryption_compute" {
      + auto_key_rotation_enabled = false
      + encryption_type           = "EncryptionAtRestWithCustomerKey"
      + id                        = (known after apply)
      + key_vault_key_id          = (known after apply)
      + key_vault_key_url         = (known after apply)
      + location                  = "swedencentral"
      + name                      = (known after apply)
      + resource_group_name       = "rg-compute-001"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # azurerm_key_vault.encryption_compute will be created
  + resource "azurerm_key_vault" "encryption_compute" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-compute-001"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "environment" = "Dev"
        }
      + tenant_id                     = "400ebb99-99e3-4a2a-af83-b2b5edff74fa"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_key.encryption_compute will be created
  + resource "azurerm_key_vault_key" "encryption_compute" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = (known after apply)
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "environment" = "Dev"
        }
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # azurerm_role_assignment.encryption_compute will be created
  + resource "azurerm_role_assignment" "encryption_compute" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.encryption_compute will be created
  + resource "azurerm_user_assigned_identity" "encryption_compute" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "rg-compute-001"
      + tags                = {
          + "environment" = "Dev"
        }
      + tenant_id           = (known after apply)
    }

  # random_string.encryption_compute will be created
  + resource "random_string" "encryption_compute" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # time_static.current will be created
  + resource "time_static" "current" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*